In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {
    "name":['harry','rohan','skillf','shubh'],"marks":[12,34,24,67]
,"city":['rampur','kolkata','bareily','antarktika']}

<h2>Data frames</h2>
we can simply convert any dictionary or data into indexes like excel files or csv file 
using the function .DataFrame()

In [3]:
frame = pd.DataFrame(dict1)

In [4]:
frame

     name  marks        city
0   harry     12      rampur
1   rohan     34     kolkata
2  skillf     24     bareily
3   shubh     67  antarktika

We are using index=False function if we dont want these rows numbers or indexes

In [5]:
# we can export this dataframe into a csv file
frame.to_csv('frndflse.csv',index=False)

<h3>if data set is too large</h3>
We can use the function .head() it will show the starting rows of the dataframe

In [6]:
frame.head(2) #we can assign the value between paranthesis how many rows we want to see

    name  marks     city
0  harry     12   rampur
1  rohan     34  kolkata

If we want to see the end numbers of rows we can use .tail() function

In [7]:
frame.tail(2)

     name  marks        city
2  skillf     24     bareily
3   shubh     67  antarktika

<h3>Describe function</h3>
we can use .describe function for statistical analysis

In [8]:
frame.describe()

           marks
count   4.000000
mean   34.250000
std    23.613203
min    12.000000
25%    21.000000
50%    29.000000
75%    42.250000
max    67.000000

<h2>Reading a csv file</h2>
We can read any csv file and create dataframe for assigining it simply using pd.read_csv function

In [9]:
new = pd.read_csv('ttt.csv.csv')

In [10]:
new

   train no.  speed        city
0        123     12      rampur
1       2435     34     kolkata
2        235     24     bareily
3      35665     67  antarktika

In [11]:

new['city'][0]# where 0 is index

'rampur'

We can change any value by assigning it like...

In [12]:
new['speed'][0] = 50

<ipython-input-12-ab6324409055>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new['speed'][0] = 50

In [13]:
new

   train no.  speed        city
0        123     50      rampur
1       2435     34     kolkata
2        235     24     bareily
3      35665     67  antarktika

In [14]:
new.to_csv('change1.csv')

<h2>Changing the indexes</h2>

In [15]:

new.index = ['first','second','third','fourth']

In [16]:
new

        train no.  speed        city
first         123     50      rampur
second       2435     34     kolkata
third         235     24     bareily
fourth      35665     67  antarktika

<h1>Series</h1> 
Series is a data structure in pandas. 
it is an one dimensional array with indexes, stores a single column or row of data in Dataframe.

In [17]:
ser = pd.Series(np.random.rand(34))

In [18]:
# ser

In [19]:
type(ser)

pandas.core.series.Series

In [20]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [21]:
newdf.head()

          0         1         2         3         4
0  0.999487  0.365850  0.783717  0.545371  0.146589
1  0.539377  0.203045  0.530070  0.448562  0.619271
2  0.555601  0.115916  0.402486  0.737475  0.813815
3  0.284190  0.620939  0.954778  0.058859  0.789269
4  0.846540  0.519684  0.267255  0.927446  0.360093

In [22]:
type(newdf)

pandas.core.frame.DataFrame

In [23]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.480797    0.497537    0.504528    0.476681    0.507495
std      0.286352    0.305216    0.294558    0.291653    0.279650
min      0.001466    0.002408    0.002793    0.008795    0.004534
25%      0.236155    0.206229    0.259801    0.216551    0.280772
50%      0.492712    0.487906    0.520929    0.451338    0.513523
75%      0.720155    0.768986    0.763338    0.723267    0.742332
max      0.999487    0.995135    0.999979    0.995716    0.998076

In [24]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [25]:
newdf[0][0] = 'tush'

In [26]:
newdf.dtypes #type is changes into object

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [27]:
newdf.head() #value is changed

          0         1         2         3         4
0      tush  0.365850  0.783717  0.545371  0.146589
1  0.539377  0.203045  0.530070  0.448562  0.619271
2  0.555601  0.115916  0.402486  0.737475  0.813815
3   0.28419  0.620939  0.954778  0.058859  0.789269
4   0.84654  0.519684  0.267255  0.927446  0.360093

<h3>We can see index and columns by</h3>

In [28]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [29]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

<h3>converting dataframe into numpy array</h3>

In [30]:
newdf.to_numpy()

array([['tush', 0.36585044037172965, 0.7837165452870707,
        0.5453709542469565, 0.14658916708777703],
       [0.539376954489997, 0.20304523740618585, 0.5300697189705728,
        0.4485615338120492, 0.619270693340969],
       [0.5556009690760294, 0.11591585315762065, 0.4024863314607283,
        0.7374747816632723, 0.8138153434772374],
       ...,
       [0.8633430290033725, 0.1561962522635627, 0.8280126611513585,
        0.41804234531138906, 0.9905902784133593],
       [0.918960219132718, 0.9088638691877889, 0.569220064908199,
        0.1041213343282259, 0.9897093446342957],
       [0.6538014719362111, 0.7648785319375229, 0.009394880709745701,
        0.12036884453585461, 0.6402960921965253]], dtype=object)

In [31]:
newdf[0][0] = 0.3

<ipython-input-31-452ed7015823>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf[0][0] = 0.3

In [32]:
newdf.head()

          0         1         2         3         4
0       0.3  0.365850  0.783717  0.545371  0.146589
1  0.539377  0.203045  0.530070  0.448562  0.619271
2  0.555601  0.115916  0.402486  0.737475  0.813815
3   0.28419  0.620939  0.954778  0.058859  0.789269
4   0.84654  0.519684  0.267255  0.927446  0.360093

In [33]:
newdf.T #transform(exchange) columns and rows

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.539377,0.555601,0.28419,0.84654,0.68725,0.0197905,0.0178411,0.438238,0.458309,...,0.215958,0.77845,0.935628,0.465083,0.459326,0.0547604,0.0692831,0.863343,0.91896,0.653801
1,0.36585,0.203045,0.115916,0.620939,0.519684,0.452175,0.00933086,0.763388,0.426305,0.115101,...,0.973236,0.706115,0.570169,0.836218,0.69749,0.572952,0.4725,0.156196,0.908864,0.764879
2,0.783717,0.53007,0.402486,0.954778,0.267255,0.157524,0.269692,0.253441,0.615476,0.0115516,...,0.487544,0.402431,0.0388337,0.29366,0.323562,0.183001,0.195543,0.828013,0.56922,0.00939488
3,0.545371,0.448562,0.737475,0.0588594,0.927446,0.0628572,0.334499,0.576642,0.414521,0.671564,...,0.175085,0.671393,0.989174,0.90938,0.0424097,0.782992,0.233997,0.418042,0.104121,0.120369
4,0.146589,0.619271,0.813815,0.789269,0.360093,0.573466,0.903534,0.867651,0.0369896,0.383171,...,0.78819,0.0405571,0.221821,0.437552,0.305949,0.0373413,0.538925,0.99059,0.989709,0.640296

In [34]:
newdf.head()

          0         1         2         3         4
0       0.3  0.365850  0.783717  0.545371  0.146589
1  0.539377  0.203045  0.530070  0.448562  0.619271
2  0.555601  0.115916  0.402486  0.737475  0.813815
3   0.28419  0.620939  0.954778  0.058859  0.789269
4   0.84654  0.519684  0.267255  0.927446  0.360093

In [43]:
newdf.sort_index(axis=1,ascending=False) #axis=0 is row and axis=1 is column and by default ascending = true

            4         3         2         1          0
0    0.146589  0.545371  0.783717  0.365850        0.3
1    0.619271  0.448562  0.530070  0.203045   0.539377
2    0.813815  0.737475  0.402486  0.115916   0.555601
3    0.789269  0.058859  0.954778  0.620939    0.28419
4    0.360093  0.927446  0.267255  0.519684    0.84654
..        ...       ...       ...       ...        ...
329  0.037341  0.782992  0.183001  0.572952  0.0547604
330  0.538925  0.233997  0.195543  0.472500  0.0692831
331  0.990590  0.418042  0.828013  0.156196   0.863343
332  0.989709  0.104121  0.569220  0.908864    0.91896
333  0.640296  0.120369  0.009395  0.764879   0.653801

[334 rows x 5 columns]

In [44]:
type(newdf[0])

pandas.core.series.Series



simply Dataframe is a combination of series

In [45]:
# newdf.sort_index(axis=0) #again to back

In [46]:
newdf2 = newdf

In [47]:
newdf.head()

          0         1         2         3         4
0       0.3  0.365850  0.783717  0.545371  0.146589
1  0.539377  0.203045  0.530070  0.448562  0.619271
2  0.555601  0.115916  0.402486  0.737475  0.813815
3   0.28419  0.620939  0.954778  0.058859  0.789269
4   0.84654  0.519684  0.267255  0.927446  0.360093

In [71]:
newdf3 = newdf.copy()

In [72]:
newdf3.head()

          0         1         2         3         4
0       0.3  0.365850  0.783717  0.545371  0.146589
1  0.539377  0.203045  0.530070  0.448562  0.619271
2  0.555601  0.115916  0.402486  0.737475  0.813815
3   0.28419  0.620939  0.954778  0.058859  0.789269
4   0.84654  0.519684  0.267255  0.927446  0.360093

In [73]:
newdf3[0][0] = hello

NameError: name 'hello' is not defined

In [74]:
newdf3.head()

          0         1         2         3         4
0       0.3  0.365850  0.783717  0.545371  0.146589
1  0.539377  0.203045  0.530070  0.448562  0.619271
2  0.555601  0.115916  0.402486  0.737475  0.813815
3   0.28419  0.620939  0.954778  0.058859  0.789269
4   0.84654  0.519684  0.267255  0.927446  0.360093

In [75]:
newdf.head(5)

          0         1         2         3         4
0       0.3  0.365850  0.783717  0.545371  0.146589
1  0.539377  0.203045  0.530070  0.448562  0.619271
2  0.555601  0.115916  0.402486  0.737475  0.813815
3   0.28419  0.620939  0.954778  0.058859  0.789269
4   0.84654  0.519684  0.267255  0.927446  0.360093

### here we can change the column indexing from numbers to alphabhets

In [76]:
newdf.columns = list("ABCDE")

In [77]:
newdf.head(3)

          A         B         C         D         E
0       0.3  0.365850  0.783717  0.545371  0.146589
1  0.539377  0.203045  0.530070  0.448562  0.619271
2  0.555601  0.115916  0.402486  0.737475  0.813815

In [78]:
newdf.loc[0,0]=654

In [85]:
newdf.head()#it will not change anything in the dataframe and it will create a new column as you can see

          A         B         C         D         E      0
0       555  0.365850  0.783717  0.545371  0.146589  654.0
1  0.539377  0.203045  0.530070  0.448562  0.619271    NaN
2  0.555601  0.115916  0.402486  0.737475  0.813815    NaN
3   0.28419  0.620939  0.954778  0.058859  0.789269    NaN
4   0.84654  0.519684  0.267255  0.927446  0.360093    NaN

## loc method

In [83]:
newdf.loc[0,'A']=555

In [84]:
newdf.head()

          A         B         C         D         E      0
0       555  0.365850  0.783717  0.545371  0.146589  654.0
1  0.539377  0.203045  0.530070  0.448562  0.619271    NaN
2  0.555601  0.115916  0.402486  0.737475  0.813815    NaN
3   0.28419  0.620939  0.954778  0.058859  0.789269    NaN
4   0.84654  0.519684  0.267255  0.927446  0.360093    NaN

As you can see it will change the value of the cell because we have run the command of column index by A